[{"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AG6KNJBDFY3LFFPXOVKG47TUBEDA", "customer_name": "Manoj Sahay"}, "review_rating": 1.0, "review_title": "Doesn't even complete the setup  ", "review_date": "17 April 2019", "review_text": "Phone doesn't even complete the setup and installation. Gets stuck after putting in email ID's, face and fingerprint recognition. I had lots of things to say about One Plus6T and Amazon but they disallowed my previous review. I raised a return request - which is subject to a technician visit and evaluation - post which i will only get a replacement ( not a refund - even if i no longer want this product). Will update this review post the technician visit.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEYOIJ3N6RIFNOJ73LD6F2ZISQEQ", "customer_name": "Gorki"}, "review_rating": 5.0, "review_title": "True flagship phone  ", "review_date": "16 April 2019", "review_text": "6t is my second oneplus phone (first was oneplus 3), always satisfied with their products with both hardware and software.the finger print sensor is acting slow at times, waiting for the tempered glass to arrive to see wether that improves the fingerprint sensor.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEMCWAPYAZKFHWXZNVLJTWAXUAXA", "customer_name": "Rohit"}, "review_rating": 5.0, "review_title": "Amazing phone for an amazing price.  ", "review_date": "16 April 2019", "review_text": "Performance is top-notch..great specs. Great RAM management and smooth gaming. The OIS was found not performing upto the mark. But considering the price its not much of a worry. The fingerprint scanner also get mushy sometimes but i never really had the needed for it cuz face recognition does a very good job and is blazing fast.  Packaging was good and delivery was right on time. Camera may not be flagship level. But it can be improved alot by sideloading GCam port. So its not much of a big deal.  The display may tend to get a bit annoying in direct sunlight .but indoor it does a great job.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH43TDF3MYDFUOJIOD25ZLMKFHKA", "customer_name": "Mehul"}, "review_rating": 1.0, "review_title": "Fingerprint scanner on screen is total failure  ", "review_date": "16 April 2019", "review_text": "Fingerprint scanner on screen is total failure, unless you enable face recognition along with fingerprint scanner phone doesn't get unlock 30% of the times.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH4R3EUCXGFCZN5APUJBAMANQ6GQ", "customer_name": "kashni bhutani"}, "review_rating": 5.0, "review_title": "Amazing phone  ", "review_date": "16 April 2019", "review_text": "The phone overall is amazing. I totally love it. The one thing that I don't like is the fingerprint reader animation.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AF7J3OTPZRDKYOAGNFKV6KWSSFSQ", "customer_name": "Venkat Aakash Kumar"}, "review_rating": 5.0, "review_title": "The best phone in this budget......HATS OFF TO ONEPLUS  ", "review_date": "16 April 2019", "review_text": "This mobile phone is really worth each peny you pay . The most fastest phone in Android and the build quality and the camera quality is just awesome \"LEVEL TO THE PEAKS\" . Did not expect this type of quality from OnePlus from this range of budget , those who are reading this review , I really suggest you to buy this product it is simply awesome....The back side for mirror black is simply classy and you need to put a nice case for this *original OnePlus case is recommended to make sure it is comfy inside . The only major issue for me is delivery part was delayed . Mine is the 8 gigs ram & 128 gigs version... I prebooked this product and was the first one to pay in Amazon . 4K video quality is simply cool and the one and only outstanding camera feature is the NIGHTS CAPE MODE , the one and only phone with this option , low light photos is mind blowing and the in display fingerprint sensor and face id is really very quick and responsive (<0.2secs) . I got it for 45,999 (incl of all protect plan) . THE MOST RECOMMENDED PHONE EVER TO MY READERS  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGOII22ML3YJIGHRLBFVP5D6KWDQ", "customer_name": "Vivek Tiwari"}, "review_rating": 5.0, "review_title": "Just fabulous and glad it's not OP7  ", "review_date": "16 April 2019", "review_text": "Everything about this phone is a delight. Amazing performance. Lightning fast unlock by face or fingerprint. Frequent upgrades from OnePlus. The camera quality is amazing. And the water drop notch is simply so cool and classy. I love the weight/handling/performance of this phone. The battery definitely lasts one whole day after a partial charge. It takes around one hour atleast to charge fully but that is satisfactory given that I use it heavily for gaming etc during the day and also for recording my meetings at working and blackboard pictures. Recently ai have also been using Google translate instant on images and that works fabulously with this device.Oh and the best part! I am glad I did not wait for OnePlus 7. The pop up selfie camera is definitely not something I want compared to this amazing water drop notch design  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AET25RVYTH4UHL773SHKAROLVNHA", "customer_name": "Santosh Gupta"}, "review_rating": 4.0, "review_title": "Nice product  ", "review_date": "15 April 2019", "review_text": "Deliver to Santosh guptaSURAT  394107OnePlus4.5 out of 5 stars  14,564 ReviewsOnePlus 6T (Midnight Black, 8GB RAM, 256GB Storage)9%off OnePlus 6T (Midnight Black, 8GB RAM, 256GB Storage)Size name: 8+256 GBColour: Midnight Black₹ 41,999MRP: ₹45,999 Save ₹4,000EMI from ₹1,977. No Cost EMI available. Options FREE Delivery.₹Save extra upto ₹ 13,100 & get more: No Cost EMI, Bank Offer, Exchange... + 3 offers10 Days ReplacementAmazon Delivered1 Year WarrantyIn stock.Guaranteed delivery to pincode 394107 by Wednesday, April 17 with Two-Day Delivery — 7 hours and 9 minutes left DetailsSold by Darshita Electronics (4.7 out of 5 | 32,478 ratings) and Fulfilled by Amazon. Gift-wrap available.With ExchangeUp to ₹ 11,550 offWithout Exchange₹ 41,999 ₹ 45,999Deliver to Santosh - Surat 394107‌Qty:Qty:1Acko 1-year Total Damage ProtectionAcko 1-year Total Damage Protection  1,999See more services and productsBuy NowAdd to CartADD TO WISH LIST2 MORE SELLERS (₹ 41,999 AND ABOVE)Need GST Invoice on this product?Sign in/Create a free business accountAdvertisementHave a question?Find answers in product info, Q&As, reviewsFind answers in product info, Q&As, reviewsAbout this itemFrom the manufacturerNightscapeLight up the night with New Nightscape technology. Artefacts are cleared up and highlights exposed.NightscapeIntelligent RecognitionSuper Slow Mo VideoStudio Lighting0:00DisplaySo Much ScreenThe more screen you have, the more you can do with your phone. From games and movies to apps and web pages, every experience is immersive thanks to our edge-to-edge Optic AMOLED display.Our Magic TouchHidden under the display, you will find our new in-screen fingerprint sensor. The OnePlus 6T unlocks the moment your finger lands on the display for a seamless and intuitive unlock experience that takes just 0.36 seconds.Truly SeamlessThanks to our new in-display fingerprint sensor, the OnePlus 6T’s design is truly unified and even. Subtle curves create a sense of flow that mesmerizes every time you look at or hold it.Powerful SmartphoneTake your game to the next level with the Qualcomm Snapdragon 845 Mobile Platform. With smooth software and powerful hardware working together, the OnePlus 6T is playing for the win. We hope you are too.The Cherry on TopWith Android Pie, you get the latest from Android improved by OxygenOS.The Cherry on TopGo Big or Go HomeColorsEveryday ProtectionDescriptionUnlock your OnePlus 6T with the fastest in-display fingerprint sensor on any smartphone. Setting a new industry standard with our cutting-edge Screen Unlock technology.SEE LESSFeatures & detailsCamera: 16+20 MP Dual rear camera with Optical Image Stabilization, Super slow motion, Nightscape and Studio Lighting | 16 MP front cameraDisplay: 6.41-inch(16.2 cms) Full HD+ Optic AMOLED display with 2340 x 1080 pixels resolution and an 86% screen-to-body ratioMemory, Storage & SIM: 8GB RAM | 256GB storage | Dual nano SIM with dual standby (4G+4G)Screen Unlock: In-screen fingerprint sensor. The OnePlus 6T unlocks in 0.34s for a seamless and intuitive unlock experienceOperating System and Processor: OxygenOS based on Android 9.0 Pie with 2.8GHz Qualcomm Snapdragon 845 octa-core processorBattery : 3700 mAh lithium-polymer battery with Fast Charge technologyIncluded in the Box: Screen Protector (pre-applied); Translucent Case; OnePlus Fast Charge Type-C Cable; OnePlus Fast Charge Power Adapter; SIM Tray Ejector; Quick Start Guide; Safety Information; OnePlus Type-C to 3.5mm Audio Jack AdapterProduct information 8+256 GB , Midnight BlackOS AndroidRAM 8 GBManufacturer OnePlusProduct Dimensions 15.8 x 0.8 x 7.5 cmItem model number A6010Wireless communication technologies Bluetooth;WiFi HotspotConnectivity technologies 2G;3G;GPS;GLONASS;Galileo;BeiDou;USB 2.0;OTG;WiFi 802.11 a/b/g/n/acSpecial features SIM;GPS;Music Player;Video Player;E-mailOther camera features 16MP (Front camera)Form factor Touchscreen PhoneWeight 186 GramsColour Midnight BlackBattery Power Rating 3700Whats in the box Handset, Screen Protector (pre-applied), Translucent Case, OnePlus Fast Charge Type-C Cable, OnePlus Fast Charge Power Adapter, SIM Tray Ejector, Quick Start Guide, Safety Information and Type-C to 3.5mm Audio Jack AdapterAdditional InformationASIN: B07DJCJBRDCustomer Reviews: 4.5 out of 5 stars 14,564ReviewsBest Sellers Rank: 171Date First Available: 31 Oct 2018Instruction Manual [PDF ]Warranty & SupportWarranty Details: 1 year manufacturer warranty from the date of purchaseWarranty information1 year manufacturer warranty from the date of purchaseBuy with accessories OnePlus 9% offThis item:OnePlus 6T (Midnight Black, 8GB RAM, 256GB Storage)OnePlus 6T (Midnight Black, 8GB RAM, 256G… 14,564₹ 41,999  ₹ 45,999+ Foso 72% offFOSO F12 Ultra Slim Silicon Sleek Rubberized Back Case Cover for One Plus 6T (Black)FOSO F12 Ultra Slim Silicon Sleek Rubberiz… 20₹ 199  ₹ 699View other accessoriesTotal price: Rs.42,198Add both to CartSponsored products related to this item Bounceback ® Oneplus 6 Cover Case (AF Series) Shock Proof Anti Slip Clear Transparent Soft TPU Back Cover Case for Oneplus 6 (Matte Red)Bounceback ® Oneplus 6...4 reviews₹ 199.00 BuyFeb Clear View Electroplate Mirror Protective Leather Flip Cover for OnePlus 6BuyFeb Clear View Elec...₹ 599.00 Noise Shots Sport Truly Wireless Bluetooth Earphones with Charging Case, Compatible with Android & iOS(Black)Noise Shots Sport Trul...1036 reviews₹ 2,999.00 Urban Armor Gear UAG Plasma Feather Light Rugged Military Drop Tested Case Cover for OnePlus 6Urban Armor Gear UAG P...190 reviews₹ 990.00 WELLTECH Bluetooth Q18 4G Smartwatch with Camera, SIM Card Support, Pedometer, Sedentary Remind and Sleep Monitoring for Smartphones (Black)WELLTECH Bluetooth Q18...2 reviews₹ 1,599.00 Cover Affair Aztec Printed Designer Slim Light Weight Back Cover Case for One Plus 6(Pink White Blue Black and Other, G2-D81)Cover Affair Aztec Pri...9 reviews₹ 398.00 TUDIA Merge Case for OnePlus 6T / OP6T- Matte Black [TD-TPU4228]TUDIA Merge Case for O...19 reviews₹ 1,199.00Customers who bought this item also bought Servify OnePlus Secure 1 Year Extended Warranty Plan for OnePlus 6T (8GB RAM + 256GB Memory)Servify OnePlus Secure 1 Year Extended Warranty Plan for OnePlus 6T (8GB RAM + 256GB Memory)5.0 out of 5 stars 3  2,299.00 Servify OnePlus Protect 1 Year Accident and Liquid Damage Protection Plan for OnePlus 6T (8GB RAM + 256GB Memory)Servify OnePlus Protect 1 Year Accident and Liquid Damage Protection Plan for OnePlus 6T (8GB RAM + 256GB Memory)4.0 out of 5 stars 6  3,199.00 GoRogue 5D Curved Edge-to-Edge Tempered Glass Screen Protector for OnePlus 6T (Carbon Black)GoRogue 5D Curved Edge-to-Edge Tempered Glass Screen Protector for OnePlus 6T (Carbon Black)3.3 out of 5 stars 5  199.00Show all 79 itemsAdvertisementCustomer QuestionsCustomer Questions Have a question? Search for answersQ: Will the Fingerprint sensor work in temp.glass or not???? Or i have to simply use any othe…A: Well it will work with temp glass coz it a small cam under the display so just go for itJitender| 5 months agoQ: Anybody hu owns this phone really miss the notification led?A: It has other cooler things thoughManojprabhu| 5 months agoQ: does one plus 6t record phone calls?A: Yes. It has inbuilt featureAmazon Customer| 5 months agoQ: What is the main difference of OP 6 & 6T?A: Finger print is removed from back to in display, 3.5mm jack port is removed, notch is smal…MUNINDRA PRATAP SINGH| 5 months agoSee all 1000+ answered questions14,564 customer reviews4.5 out of 5 stars4.5 out of 5 starsRated by featurePicture quality4.54.5Sound quality4.54.5Battery life4.54.5By customer groups & interestsAvengers4.6Amazon Prime members4.5Is this helpful?YesNo  SEE MORERead reviews that mentionbattery life picture quality fingerprint sound quality value for money headphone jack night mode flagship killer camera quality battery backup best phone quality is good never settle price range super fast face recognition print sensor print scanner dash charging good batterySee moreTop reviews  Tanmay Shukla5.0 out of 5 starsVerified PurchaseSize: 6+128 GBColour: Mirror BlackI got this phone on Friday evening. Pros: Great battery life Amazing performance Premium design Impressive rear and front camera In display fingerprint scanner is really fast... Surbhi Garg2.0 out of 5 starsVerified PurchaseSize: 6+128 GBColour: Mirror BlackCamera quality is not upto the mark. I visited one plus store and the store representative checked my phone and compared the camera quality with his demo phone. He noticed a... Saroj N.1.0 out of 5 starsVerified PurchaseSize: 8+128 GBColour: Midnight Black1. The Battery lasts max of 6 hours. 2. Major application not working in the upper side of the screen. 3. Camera quality is very poor. 4. Audio output through earphone is...See all 14,564 reviewsWrite a reviewCustomers who viewed this item also viewed Honor View20 (Blue, 8GB RAM, 256GB Storage)Honor View20 (Blue, 8GB RAM, 256GB Storage)4.3 out of 5 stars 491  45,999.00 Honor View20 (Blue, 6GB RAM, 128GB Storage)Honor View20 (Blue, 6GB RAM, 128GB Storage)4.3 out of 5 stars 491  37,999.00 Honor View20 (Midnight Black, 6GB RAM, 128GB Storage)Honor View20 (Midnight Black, 6GB RAM, 128GB Storage)4.3 out of 5 stars 491  37,999.00Show all 38 items  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGZS7DLTA3AIMXGRI3THZFFKBEOQ", "customer_name": "Mayank Thakur"}, "review_rating": 3.0, "review_title": "face unlock & fingerprint sensor  ", "review_date": "15 April 2019", "review_text": "face unlock & fingerprint sensor doesn't recognize me sometimes.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AF5FRXF44JDXAUZSGCVJM3FM4DHQ", "customer_name": "Bhumika Chouhan"}, "review_rating": 5.0, "review_title": "Great phone  ", "review_date": "15 April 2019", "review_text": "Only fingerprint reader is d drawback  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFLX5CHNKUX6GIED7EPGARR45ONA", "customer_name": "Rohan Puranik T R"}, "review_rating": 4.0, "review_title": "Fingerprint is not detecting  ", "review_date": "15 April 2019", "review_text": "Fingerprint  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFV5KQ6HR6IROAVDQNHBJJXWAISA", "customer_name": "Amazon Customer"}, "review_rating": 4.0, "review_title": "Fingerprint is slow  ", "review_date": "15 April 2019", "review_text": "Fingerprint sensing is little slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH6EODPNQXJP4DAPLORS6EXARUCQ", "customer_name": "Aliabbas Z."}, "review_rating": 5.0, "review_title": "Worth 5 Stars  ", "review_date": "15 April 2019", "review_text": "Liked: Best flagship killer in the market. Worth the money invested. High end games run smoothly without lagging. Feels premium quality while holding in hand. Has Tupe-C charging (fast charging). In-display fingerprint sensor, Teardrop notch (better than the bigger notches of other flagships), Decent Camera, Oxygen OS 🥰 and last but not the least - got it delivered to me next day!Disliked: Average battery, mono speakers, gets warm (more than you would expect) while playing high end games such as PUBG  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHMK432OGSOCYDPQQO3QY7B5KF5A", "customer_name": "Amazon Customer"}, "review_rating": 5.0, "review_title": "Good  ", "review_date": "14 April 2019", "review_text": "Reviewing after 2 months.Cons:-Fingerprint sensor posses delayed access after using it for a period of time.Pros:-Picture quality is very good.Quick charging.Built quality is very good.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AF7WWYZV63WPGYLBR37VO2L6C75A", "customer_name": "Sudeshna"}, "review_rating": 5.0, "review_title": "Superman of a Cellphone!  ", "review_date": "14 April 2019", "review_text": "Heck of a cellphone! Just loving the speed and performance! Touch feels like feather, camera quality decent, warp charging charges the phone superfast, fingerprint reader is a bit slow. Overall one of the best phone in this pay range. Worth the money!  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHAM7SOLHQDC2UGPGOFBGBJJHTMA", "customer_name": "Yogesh"}, "review_rating": 1.0, "review_title": "Plz don't puchased this mobile  ", "review_date": "14 April 2019", "review_text": "I have purchased one plus 6t 6gb  on 31st March 2019 at37999rs  bt today price is 34999 just 10 days company drop the price I have loss the 3000 rs plz don't purchased this product... fake company and this phone use not properly fingerprint not use fastly....face recognition also .Soo plzz don't purchased this phone...bad experience for one plus 6T  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEV5KZVZI57PLMZE4JD563R56CAA", "customer_name": "mahesh m"}, "review_rating": 5.0, "review_title": "A beast for your hard earned money  ", "review_date": "14 April 2019", "review_text": "Excellent phone for this price range. Leaving aside a few hiccups on fingerprint sensor(a bit slow) which is covered up by the super accurate face recognition, the phone does justice for the money spent.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEC337H6LK6O6EZKKRXV6VPUTAXA", "customer_name": "Yogesh pujari"}, "review_rating": 4.0, "review_title": "Not best but satisfied  ", "review_date": "14 April 2019", "review_text": "Fingerprint reader is a bit slower and sometimes it's frustrating. Otherwise oneplus is the best no doubt👍  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHBWQO4H2GTS35TFQA2LP64FU3SQ", "customer_name": "Pooja"}, "review_rating": 4.0, "review_title": "Good phone but few shortcomings  ", "review_date": "14 April 2019", "review_text": "ProsBrilliant displayFace unlock is accurate.Fast charging and very good battery lifeOS is simple and non cluttered , close to stock androidNotch design is good.ConsFingerprint scanner doesn't work properly.No headphone jack.Loudspeaker placement is not good. Most of the time I cover it while using landscape mode.Camera could have been much better as compared to many cheaper phones.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGD7Y46RMDJWYER2FCFDXQUKVLFA", "customer_name": "Sandesh Thakare "}, "review_rating": 5.0, "review_title": "Excellent 👍  ", "review_date": "13 April 2019", "review_text": "Face recognition is awesome on this cellphone but when time to unlock with fingerprint it's take little bit time n not easily unlocked it  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFTXH53Z33ZW3MSTD2CDKKCZVKHA", "customer_name": "PRATIK GAWADE"}, "review_rating": 5.0, "review_title": "FINGERPRINT READER WORKS LIKE A CHARM.  ", "review_date": "13 April 2019", "review_text": "Even I had some concerns about indisplay fingerprint reader before buying this product but after using it for 2 weeks now, it seems that the fingerprint reader works same as the physical fingerprint reader. Though it may seem like indisplay fingerprint reader is slow but trust me it's the same blazing fast speed when I compared it with one plus 6.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGIOPVN67AHKTFGBHDW5A4AQJDTA", "customer_name": "shashank"}, "review_rating": 3.0, "review_title": "Worst Deliveryy  ", "review_date": "13 April 2019", "review_text": "Worst phone delivered.Getting heated up while initial setup.Only left side speaker is working.Camera is not up to the mark promised.Fingerprint doesn't work always.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFGT6EOE43NXFGO4SLUERTCYOEZQ", "customer_name": "Amazon Customer"}, "review_rating": 4.0, "review_title": "Not worth a buy big disappointment  ", "review_date": "13 April 2019", "review_text": "Expectations were high big disappointment. Video quality very very bad. Slow motion always shows bad light. At night camera useless. Fingerprint sensor one of the slowest. Battery drains fast.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFVWWSO4KHVNOIGX3XDKMB6X4MGQ", "customer_name": "Kumar Shivam"}, "review_rating": 4.0, "review_title": "Best budget phone  ", "review_date": "12 April 2019", "review_text": "Face recognition is super fast, fingerprint reader is ok not that quick if compare to capacitive fingerprint reader it takes noticeable time. And Camera is good with decent image stabilization.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHY6MDPUCTEPFX6JSUF7YZLUU6EQ", "customer_name": "irfan shaikh"}, "review_rating": 2.0, "review_title": "Faulty fingerprint sensor.  ", "review_date": "12 April 2019", "review_text": " I received the phone today. I started the phone and booted the phone. I registered only one fingerprint on the phone. i.e. My left thumb. While I was showing the phone to my colleagues, one of my friend's right thumb was able to open the phone even though the said thumb is not registered. Shocked to see this. One plus needs to look into this security issue. I have not written a detailed review.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHKAGHVCWEYEPCWSLU5ZMAQ6HFQQ", "customer_name": "Amazon Customer"}, "review_rating": 4.0, "review_title": "Take it!!  ", "review_date": "12 April 2019", "review_text": "Great product. The dewdrop design is superb. The fingerprint and face unlock work great but the face unlock gets tiresome at times. Sometimes it unlocks when you don't want it to.But otherwise no issues.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFWSVVSP56RAC4YJUMJOH3OPOKPQ", "customer_name": "Manoja Valmiki"}, "review_rating": 5.0, "review_title": "Worth the money!  ", "review_date": "11 April 2019", "review_text": "Awesome..just the fingerprint sensor is a bit slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGFWC5XWC6TGWPDGFZWLZLFOSRLQ", "customer_name": "Sarfaraj ahmad"}, "review_rating": 5.0, "review_title": "SIMPLY GO FO IT  ", "review_date": "11 April 2019", "review_text": "Have been using this product for three months now.. Phone is fast as hell..Fingerprint seems to be slow sometimes but that's ok as the face recognition works absolutely fine..  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH2ITYIC37BLFN2KI7G5ACNR7OWQ", "customer_name": "Kindle Customer"}, "review_rating": 5.0, "review_title": "Good deal  ", "review_date": "11 April 2019", "review_text": "Phone is a good deal for money. Display is great. Touch is also superb.They can work on the fingerprint recognition.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHNDJ2Q7XUP5YTW6BYGQ67UFPFTA", "customer_name": "Chirag"}, "review_rating": 5.0, "review_title": "best smart phone ever  ", "review_date": "11 April 2019", "review_text": "I got this phone on Friday evening.Pros:Great battery lifeAmazing performancePremium designImpressive rear and front cameraIn display fingerprint scanner is really fastCons:No headphone jack but you'll get a converterNo notification LEDNo microSD card slotI will give points on my personal experience of 2 days full usage as below:Weight: 9/10OS: 10/10Screen size: 10/10CPU: 10/10Performance: 10/10Storage: 10/10 (you'll get approx 113 gb for use)Battery: 8/10Rear camera: 10/10Front camera: 10/10In display fingerprint scanner: 9/10Face unlock: 10/10  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFQXD32LEXQWUZNCDDHMGIWQA7OQ", "customer_name": "Ankur Das"}, "review_rating": 5.0, "review_title": "Excellent Performance  ", "review_date": "11 April 2019", "review_text": "Its an worthy upgrade from any mid range phone. Everything is good apart form the In-Display fingerprint sensor. The fingerprint sensor can be improved as it miss to recognize quite a few times.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGFHPRMIBKBELYKGKGUA5B2OEDLA", "customer_name": "Meghna Pathak"}, "review_rating": 5.0, "review_title": "Best phone  ", "review_date": "11 April 2019", "review_text": "Fingerprint is awsome.. n awsome ph ..n delivery is also good ..  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHTHJJV6YAEPVGVROGKSSGC5JXJQ", "customer_name": "tarun kumar"}, "review_rating": 5.0, "review_title": "Fingerprint  ", "review_date": "11 April 2019", "review_text": "Perfect phone  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHTHBB5EAQDUWQCCMJPS7KRJDGNQ", "customer_name": "Amazon Customer"}, "review_rating": 5.0, "review_title": "Value for money  ", "review_date": "10 April 2019", "review_text": "Fingerprint is less effective  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGYK3SKC4P3NCX5PMAPGUGV54A3A", "customer_name": "Singh Sudhir Ramashankar "}, "review_rating": 5.0, "review_title": "The performance  ", "review_date": "10 April 2019", "review_text": "Fingerprint not recognise after some days..  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHHT52MAFXENEHRXMZWQAKGO7BHQ", "customer_name": "Siddhant Chhajed"}, "review_rating": 5.0, "review_title": "Beast  ", "review_date": "10 April 2019", "review_text": "Disappointed with fingerprint scanner  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGLBD4L57UFK7QC7WYGQPMVI7AVA", "customer_name": "Amazon Customer"}, "review_rating": 4.0, "review_title": "Worth those bucks....😉😀  ", "review_date": "10 April 2019", "review_text": "It's been around 3months since i moved into this marvel from my moto z play, till now this machine hasn't disappointed me a bit. Though the imaging department might need improvements, considering what i am getting for the price i paid, surely am completely satisfied. As advertised, this phone has been buttery smooth ever since though the in display fingerprint sensor can be a bit slow. Good to be part of the oneplus family....😊😉  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHCT3C3ZXRUWW4NTSWOXLWZD23ZQ", "customer_name": "Ashwini"}, "review_rating": 4.0, "review_title": "-  ", "review_date": "9 April 2019", "review_text": "Fingerprint scanned take so much time for unlock the mobile.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHH6VFXW6I3RFXMWLHHSFJN6H4MQ", "customer_name": "Sarthak panwar"}, "review_rating": 4.0, "review_title": "There is no headphone jack  ", "review_date": "9 April 2019", "review_text": "The phone is really very nice and the in-display fingerprint is excellent.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH4J5NUO4KFQCN4E4IBRH32VQCRQ", "customer_name": "Kartik Kumar Agarwal"}, "review_rating": 4.0, "review_title": "Amazing performance without breaking the bank!  ", "review_date": "8 April 2019", "review_text": "Overall: 8/10:A fantastic package at good value. 6T McLaren is'nt much different from the standard 6T except for the RAM and some minor cosmetic changes. But for a long time fan of the Silver Arrows from Mika Hakkinen's time, a small increase in price was worth it. Call me sentimental! :)Unboxing & contents: 8/10One of the coolest unboxing experiences. The McLaren box is very premium and the booklet starts with giving you a brief glimpse into the history of the brand and some cool pictures from the archives. It is an homage to Bruce McLaren to be honest. The Speed Mark (real Carbon Fire cutout of the McLaren logo) encased in acrylic is pretty good and can serve as a cool table top accessory or paper weight. If not for much it can be a good ice breaker for visitors to your home / office. The Charger and Cable are also customized for the McLaren edition. The Soft PU case is simple black and fits snugly. There was a missed opportunity to throw in some colour for the McLaren edition. All else is pretty much standard. Providing only a USB-C to 3.5 converter is a bummer. For the flagship offering at over 50K, throwing in a Bullet Earphone should have been standard.First Impressions: 9/10The device is actually pretty impressive looking. Especially the orange accents at the Bezel on the back. When you change the angle under light, it almost looks like there are LEDs inside. It looks premium for sure though an actual Carbon Fibre body would have been awesome! Be warned though that the surface is a fingerprint magnet and not easy to wipe off unless you use a good cleaning spray. The Waterdrop notch is barely noticeable and is not much of an issue. The colours are vibrant and while setting up you can choose a profile that suits your taste.Setup: 8/10The SIM Card tray is a standard two Nano-SIM one. No SD Card support still! But with 240 GB usable memory, not much of an issue to be honest. I used the OnePlus switch app to transfer my apps, data and settings. The transition was hassle free and took all of 15 minutes. Most apps worked immediately but a few needed to be uninstalled and reinstalled as they were acting up. I gave it a point less as I think the OnePlus Switch app should be integrated at the setup stage instead of making a new user download it. The phone heats up considerably but it was fine after the initial 30 minutes.Battery: 7/10The unit came with 50% power out of the box and it took me a good 30 minutes to get it to 75% despite using the Warp Charge @ 30W. Probably it was due to the fact that close to 100 apps were being downloaded while it was charging. I will check the charging performance over the next few weeks and update review if required.Performance: 9/10Gaming: Initial performance on gaming is very very good (Asphalt 9 Legends and Real Racing 3). Zero lag and super smooth rendering.  Bloons TD6 is a very resource hungry at lategame levels and the 6T McLaren  made short work of it.Display: The display is really mind-blowing. Video on Youtube and other streaming apps was super smooth and brilliant to look at. One cool feature is that you can pinch zoom the content to include / exclude the waterdrop notch for front camera.  Adaptive brightness is annoying at times and I had to turn it off while playing the racing games.Camera: Have not tested the Camera performance yet. Especially the 4K 60 FPS option. Will do it soon and update the review.Hope this helps!  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGTNMOKS6N3E5HFMLUTBTW25UVFQ", "customer_name": "Saransh khobragade"}, "review_rating": 4.0, "review_title": "Should have gone for oneplus6  ", "review_date": "8 April 2019", "review_text": "You should go for one plus 6,2.It has worst on screen reader yet,tech is nt to realiable as physical fingerprint scanner.3.Bad sound output via dongal,somehow original dongal supress quality of music, Bluetooth works fine,again dongal life is heache.One plus 6 has everything it has just a bigger notch,belive me headphone zack sounds better than dongal.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGJIWWT7D7X4P5NRTFNZAZX5NIRA", "customer_name": "Unknown"}, "review_rating": 4.0, "review_title": "Fingerprint scanner sensor  ", "review_date": "8 April 2019", "review_text": "Fingerprint scanner sensor is bit slow. And I found some bugs even during usage. Otherwise its a good phone.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFI6XQ4X4HJW2KSBVPMQ34NYO2RA", "customer_name": "Customer"}, "review_rating": 5.0, "review_title": "One Plus 6  or 6T???  ", "review_date": "7 April 2019", "review_text": "Both are great.Lots of simmilarity.6T doesn't have a headphone jack. Its on-screen fingerprint sensor slow.So please compare both before buying. Not much difference in technology  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFQTTUNEMP3DPHDYVDQ6ZR3HGZEA", "customer_name": "Ashish Tiwari"}, "review_rating": 5.0, "review_title": "A GREAT PHONE TO HAVE !!!  ", "review_date": "7 April 2019", "review_text": "Hi , i am one of the first buyers of this one plus mc . Edition , i have done an unboxing on my channel about htis product ..It is a great phone and the features it provides is more likely an iphone but costs you lower than that..More in formation is given belowDescription::--Unlock the speed with the new OnePlus 6T.Features & details::-Camera: 16+20 MP Dual rear camera with Optical Image Stabilization, Super slow motion, Nightscape and Studio Lighting | 16 MP front cameraDisplay: 6.41-inch(16.2 cms) Full HD+ Optic AMOLED display with 2340 x 1080 pixels resolution and an 86% screen-to-body ratioMemory, Storage & SIM: 10GB RAM | 256GB storage | Dual nano SIM with dual standby (4G+4G)Screen Unlock: In-screen fingerprint sensor. The OnePlus 6T unlocks in 0.34s for a seamless and intuitive unlock experienceOperating System and Processor: OxygenOS based on Android 9.0 Pie with 2.8GHz Qualcomm Snapdragon 845 octa-core processorBattery : 3700 mAh lithium-polymer battery with Fast Charge technologyIncluded in the Box: Screen Protector (pre-applied); Translucent Case; OnePlus Fast Charge Type-C Cable; OnePlus Fast Charge Power Adapter; SIM Tray Ejector; Quick Start Guide; Safety Information; OnePlus Type-C to 3.5mm Audio Jack AdapterProduct information ::-10GB+256GB , Speed OrangeOS AndroidRAM 10 GBManufacturer OnePlusProduct Dimensions 15.8 x 0.8 x 7.5 cmItem model number A6010Wireless communication technologies Bluetooth;WiFi HotspotConnectivity technologies GPS;GLONASS;BeiDou;USB 2.0 OTG;IR blaster;Bluetooth v5.0 wireless technology;Wi-Fi 802.11 a/b/g/n/ac;2.4G/5GSpecial features SIM;GPS;Music Player;Video Player;E-mailOther camera features 16MP (Front camera)Form factor Touchscreen PhoneWeight 186 GramsColour Speed OrangeBattery Power Rating 3700Whats in the box Handset, Screen Protector (pre-applied), OnePlus 6T McLaren Bumper Case, USB Type-C Cable, Power Adapter, SIM Tray Ejector, Quick Start Guide, Safety Information, USB Type-C 3.5mm Adapter, McLaren Speed Mark and McLaren BookThank you for reading this review .Pls click on the thumps up if you find this review helpfull.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHIVWEZCTFEANGRYAQH7YM7XX5NQ", "customer_name": "sandeep"}, "review_rating": 3.0, "review_title": "Not worth  ", "review_date": "7 April 2019", "review_text": "Not a very good experience..just a hype. Touch is not perfect, fingerprint recognition sucks. Face recognition is bit good. Within 4 months i can experience a little lag. Also just 2 weeks back i recognise its one speaker is not working.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHH3TVBG6IKOZJIV2ERRBJJGGCEQ", "customer_name": "Nitish rajeev"}, "review_rating": 3.0, "review_title": "New updates required to fix all bugs  ", "review_date": "7 April 2019", "review_text": "Lag in fingerprint rest built quality is good wd good cam, value for money product  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFXP4BY7Z6KUH35SYIJU55QZYUTQ", "customer_name": "Amazon Customer"}, "review_rating": 5.0, "review_title": "best phone  ", "review_date": "6 April 2019", "review_text": "super fast the speed everybody wants in all manners it is the best......specially on screen fingerprint sensor and apps  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHHMPMABYMVVVQ4RBOJFQ4LMAOGA", "customer_name": "Edwin_kuttanz"}, "review_rating": 5.0, "review_title": "An honest review by an ordinary user  ", "review_date": "6 April 2019", "review_text": "Phone performance is superb.battery backup really amusing.image gets distorted sometimes due to lack of stabilization.but video quality is absolutely wonderful.no heating issues.people say that fingerprint scanner is slow,but it's not true,it's really fast.you can buy with confidence 😎  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGUULXZW4SNPZKYH25ZYOPW2ZRKA", "customer_name": "Udaiark Machirozu"}, "review_rating": 3.0, "review_title": "Fingerprint recognisation delay not upto mark  ", "review_date": "5 April 2019", "review_text": "Oneplus 6T - Expected Fast recognition on Fingerprint. Only reason i moved from my MI 6pro to this. But same result with 41K+ and below 10+ mobiles.Not even satisfied with Photo quality compare with MI pro 6  ( almost 4 times cheaper is giving Good Performance  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHFSKR4C36XASY57EUB77YWBHOEA", "customer_name": "ANEEZ RAJ"}, "review_rating": 5.0, "review_title": "Must improve fingerprint lock.  ", "review_date": "4 April 2019", "review_text": "In display fingerprint lock is not stable...poor perfomance of fingerprint lock.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFIWIAW7OY4CWCWT2LWE2RAGP77A", "customer_name": "Shipra"}, "review_rating": 5.0, "review_title": "Phone is good  ", "review_date": "4 April 2019", "review_text": "Nothing to dislike about phone is good. But they must try new design for phones. Onscreen fingerprint is slightly slow.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AETD7XMC4DTTEN4GLKYHZFYMV6JA", "customer_name": "Aish"}, "review_rating": 5.0, "review_title": "Never Settle !!!!  ", "review_date": "3 April 2019", "review_text": "Not only amazing camera quality,high speed processor n enough storage but also cool notch look n fingerprint sensor makes it damn attractive.I love it for its battery life n super fast charging  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEN7QHBYRTUKVKWSLNQSPY77DDMA", "customer_name": "ChandrakantSingh"}, "review_rating": 5.0, "review_title": "Premium phone with a friendly price  ", "review_date": "2 April 2019", "review_text": "This is my first OnePlus phone and boy am I surprised how good it is. Here are few things I have found after 5 days of usage:Pros:1. Great Camera - The camera is awesome in this phone. I have attached few pics taken from this phone and they look great. The color reproduction is not exactly 100 percent but very close. The images turn out a little bit more colorful than they actually are but they look really good. Selfies in portrait mode are very good and even without the portrait mode they look great. The profession mode is wonderful if you can take some time learning how to use it. The pic of the mango that I have posted was taken in the professional mode. The HDR mode produces good evenly lit pictures - the pic of pink flowers against the sky background and the night mode is a great add on. Videos in 4k 60fps are stunning. This in fact is one of the very few phones out there which can record 4k at 60fps which is usually something that most pricey flagship phones are capable of. There is one thing to be noted here though that the video length cannot be more than 5 minutes. I purchased this phone for the camera and it has not disappointed me ever.2. Good Battery life - With some 4 hours of music listening, 1 hour of browsing and youtube videos, the phone drains by around 70% in 14 hours. The charging is fast.3. Speed - The Phone is very responsive and smooth. Haven't played games yet on it but am sure the phone would be able to handle that with ease. It feels like a fast phone.4. Permium feel - The phone is a little heavier than other phones of almost the same size so feels solid and premium. While some people might feel the lighter the phone is the better it is, it's my personal opinion that a slightly heavier phone feels good.5. Screen - The screen is bright and has stunning clarity.Cons:1. The in-screen fingerprint sensor - This is kind of the weakest link. The finger print sensor is slow. It feels slower than some of the sub 20000 phones out there. Of course this kind of comparison is like apples and oranges because this is an in-screen sensor and I am comparing it with the sensors at the back but still. It feels slow. The face recognition though is zippy and very fast.2. No provision for 3.55 mm jack. So you cannot listen to songs while charging the phone(Unless you have bluetooth headphones of course)Apart from these two things the phone is pretty much complete and at the price at which it is available now, definitely worth the money.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AF5J2YBN5YTZQJCZ4HMG6ZKYXLWA", "customer_name": "Kunal Phadte"}, "review_rating": 5.0, "review_title": "The Best Android phone  ", "review_date": "2 April 2019", "review_text": "Design and Build quality: too good. Durable and stylish.Display : beautiful. Crisp.OS: Oxygen os is the best. In fact better than stock.Camara: decent for photography. Very good for video because of ois.Fingerprint sensor : bit annoying at the beginning but with time it learns your fingers better. After 45 days it's working perfectly now.Face id : too quickRam management: very goodBattery optimization: very good. It gives me 7 hrs of screen on time.Overall very happy 😊  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEZUENQWC5AN4AG2X4ZNON46WHTQ", "customer_name": "Attituate"}, "review_rating": 4.0, "review_title": "Good one  ", "review_date": "1 April 2019", "review_text": "The under display fingerprint works 9/10 if the surface is fully cleaned.Fits well and feels good.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEQZZV4UBG6QGZ6BGKHEWISVY5EQ", "customer_name": "Atul Purohit"}, "review_rating": 5.0, "review_title": "Something I bought and will never regret! Go for it guys. :)  ", "review_date": "1 April 2019", "review_text": "Before I write something about the phone or its specs, I would like to say I keep changing smartphone and usually I buy in range of 10K-15K however, since last 1 year no smartphone was fascinating me apart from POCO F1 but already being a MI user ( 6 MI phones used since last 5 years) and few cousins already owning it,  It didn't allow me to buy same. But, I was more concern with the price and then I started searching a lot about all the latest smartphone who has Snapdragon 845 SOC I ended up my search on One Plus 6T.Today, I'm happy enough to share this review after using the device for 3 months. All I would say if you have a budget of 30K then spend some more and go for One Plus 6T as of now.Now Lets talk about pros and cons:Pros:Great battery life With super fast chargingAmazing performance and smart boost featurePremium design with shining glassImpressive rear and front camera with good quality low light capturingIn display fingerprint scanner is really fast and I Love the cosmos effectNo heating at all, I m a pubg lover too.Cons:No headphone jack but you'll get a converter, I wished they could provide ear plug directly instead of converter.No notification LED lightsNo microSD card slot but Its okay I m not much storage guy 128GB is more than enough for me.The major one for me atleast, PRICE I know its a flagship device but I want this at 30KRating as per the usage of last 3 months so far.Weight: 9/10OS: 9/10Screen quality: 9/10CPU: 10/10Performance: 10/10Storage: 10/10 (113 gb almost)Battery: 9/10Rear camera: 9/10Front camera: 8/10In display fingerprint scanner: 9/10Face unlock: 8/10Thanks. I hope this will help you a bit to decide.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AF5OYSZBIEE2S4LYSBM7MLN2P3RQ", "customer_name": "sanj"}, "review_rating": 5.0, "review_title": "Beast in action  ", "review_date": "1 April 2019", "review_text": "Best phone to buy, never hangs, only con is fingerprint recogn is slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFUQ7RMKHBBIYVJOOQKMBXO727RA", "customer_name": "Amazon Customer"}, "review_rating": 5.0, "review_title": "Improve fingerprint scanner  ", "review_date": "31 March 2019", "review_text": "Please improve fingerprint scanner.. remaining everything is excellent  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFDEVJ3LVHWCVPXETLNIYR3CKJLQ", "customer_name": "Anisha"}, "review_rating": 5.0, "review_title": "Must buy!  ", "review_date": "31 March 2019", "review_text": "Best buy yet! Love it a lot! The face recognition is super quick. Though the inbuilt fingerprint is a little slower than a physical one, it's fairly quick once u understand how much pressure it takes to unlock. Besides that the Oxygen OS works like a charm! 5 🌟 🌟 🌟🌟🌟  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AG723X57ZSBWTCLHJYKITAU76UGA", "customer_name": "P.K.Azad"}, "review_rating": 1.0, "review_title": "Not good for this price  ", "review_date": "31 March 2019", "review_text": "Indisplay fingerprint . very slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHGG5AEWXI736SENKUONRJJBYQ7A", "customer_name": "Sumit Kar"}, "review_rating": 5.0, "review_title": "Nice camera  ", "review_date": "31 March 2019", "review_text": "Fingerprint sensor takes some time  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEN5PKNWCE6QKR4PFECPLYXQ2FSQ", "customer_name": "Pranjal bhada"}, "review_rating": 3.0, "review_title": "Phone is good for speed but you need as camera please not go for it  ", "review_date": "31 March 2019", "review_text": "The phone is best, really salute the speed , fingerprint scanner & face recognize is also good , lets come at camera is worst not with quality but with system camera some time not able to focus on object and also camera is not opening, after 30inute of regular use of camera .  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGXAAIHGWRNUHJJN723AQ6UG4OPA", "customer_name": "saravanakumar"}, "review_rating": 4.0, "review_title": "Fingerprint  ", "review_date": "31 March 2019", "review_text": "Fingerprint sensor is very very slow..  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGIIE2TYPAHFYHQGEJYUXVCUU4YA", "customer_name": "avneesh s."}, "review_rating": 3.0, "review_title": "Nice phone but not as per expectations.  ", "review_date": "30 March 2019", "review_text": "I have been using blackberry since 2008. After blackberry i switched to samsung in 2015. I could not use it for more than 3 months and i switched to one plus.I got oneplus 3t and it was amazing. I used it for 2 years and decided to use oneplus for life.I got oneplus 6t on 3rd nov 2018, ordered the day it was launched. Had very high hopes but it disappointed me.The fingerprint phone locker is really not working ok. Battery is also not very good.Apart from that the phone is ok. I gave it a 3 star, as i had high hopes from this phone.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHOWYMCXKUMMB5QPBLKS7MF7X27A", "customer_name": "Ammar Saifee"}, "review_rating": 4.0, "review_title": "Nice Phone...  ", "review_date": "29 March 2019", "review_text": "Using the phone since last 2 weeks...Overall it is good...Camera and Battery backup is Gr8...The only problem I am facing is its Fingerprint Scanner...It dosen't unlock immediately..Need improvement in that...Also when scrolling in Whatsapp if you are in a chat and you move out of the chat and try to scroll immediately it doesn't scroll up..it takes a second for scrolling...Checked with my friends mobile too...He also faces the same issue...  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFTYUHJXB6QXQOC4EIOANJDE6QOQ", "customer_name": "Manoj"}, "review_rating": 4.0, "review_title": "Fingerprint sensor not so fast  ", "review_date": "29 March 2019", "review_text": "Fingerprint sensor could be better and fast.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHJMRSER7CI6NQD5NWBAM7SHNG2Q", "customer_name": "amrit rodrigues"}, "review_rating": 5.0, "review_title": "8GB 128 is the champion!  ", "review_date": "28 March 2019", "review_text": "Bought the 6T recently, going back to Android after 5 year hiatus! was with 5S apple since 2014.Why i bought it :1. Best flagship at a budget when compared to upgrading to Apple 8 and above2. Great Build quality3. Right features4. Great store experience5. Great Screen6. Great battery life7. Good quality back cover (silicone)8. Pre installed screen guardCons (Nit picking here not really cons considering the overall package ):1. no Headphone jack , though a converter ships along inbox2. expensive OE accessories in store3. Clunky charger4. Gloss Black color back is a fingerprint magnet5. Otter Box cover very expensive :(  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AG256KLUW5OKHOCALC7T7NQVVFCA", "customer_name": "Poonam Gupta"}, "review_rating": 3.0, "review_title": "Could be better but it's not...  ", "review_date": "28 March 2019", "review_text": "I am using one plus 6T from November 18..Potrait mode and night scape mode not working well...my phone started hang. I have to restart it to use after hang.. fingerprint not woked many time s...not good as expected...  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AED4ZJVQKX2RTHTJ5HHW7NA3JJCA", "customer_name": "Zeeshan Sadar"}, "review_rating": 4.0, "review_title": "Com  ", "review_date": "28 March 2019", "review_text": "Fingerprint slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHA3ZFSYPQU7PSBOKUX77JIY7QMQ", "customer_name": "Thomas"}, "review_rating": 4.0, "review_title": "Excellent device  ", "review_date": "28 March 2019", "review_text": "Overall nice device. Smooth performance. The in-display fingerprint is much better than I expected it to be  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AE7RNRVX6XDPLD6CKYQNHFPEO56Q", "customer_name": "Abhishek Kumar"}, "review_rating": 2.0, "review_title": "Not a True Flagship  ", "review_date": "28 March 2019", "review_text": "Being a flagship killer, it still have some cons which should be considered in the next upgrade.1. In-display fingerprint scanner doesn't work  most of the time.2. Looks is not that great. With the back cover  on, looks like a simple bar phone. Atleast One  plus logo should be highlighted.3. Low light photography is very poor. In indoor  conditions, its photos can't be appreciated.4. Software features like wallpaper carousel, registering two faces in face unlock, themes etc are absent.These are the cons which have disappointed me.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AG6F4NNCSFCZPRYCRWM7V73JLROA", "customer_name": "Abhishek Gupta"}, "review_rating": 4.0, "review_title": "Good  ", "review_date": "28 March 2019", "review_text": "Fingerprint and face detection is really slow. Not upto the mark  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGRIAPFMQOKPNL4GBAP2INDRHOVA", "customer_name": "Jayant R"}, "review_rating": 4.0, "review_title": "Amzing phone overall  ", "review_date": "27 March 2019", "review_text": "Been using this phone since feb the phone overall is a amazing device.... Works like magic with it's snapdragon processor and RAM building quality is good.  One major down side for this phone is the fingerprint scanner as it works really slow when compared with my previous phones and I have only been using face recognition to unlock this device  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AG5OOYIS6EN3IJJML3I3ZZK3LV6Q", "customer_name": "Sanju singh"}, "review_rating": 4.0, "review_title": "One+ is not proving yourself in this phone and cost  ", "review_date": "27 March 2019", "review_text": "Fingerprint sensor is very slow. And camera quality is not justify the camera specific  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH4YEPNEZOYMISCEIKSIYWSANS6Q", "customer_name": "Jainam Shah"}, "review_rating": 4.0, "review_title": "Almost perfect phone only two complaints  ", "review_date": "27 March 2019", "review_text": "All the things are perfect even I am not having any issues with the under display fingerprint sensor only two cons...Headphone Jack is missing, Removal of dust from the speaker grill is very difficult  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHSSSA3HKMEUIJXNDPXKRKHVWB6Q", "customer_name": "AkHIL"}, "review_rating": 5.0, "review_title": "Good phone  ", "review_date": "27 March 2019", "review_text": "It's a beast but fingerprint lock is bit low  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGHTJKCNMK3552PLEAQEL7CK2B6Q", "customer_name": "Nitin Verma"}, "review_rating": 5.0, "review_title": "Never settle for anything less than a oneplus  ", "review_date": "26 March 2019", "review_text": "Only thing that lacks is fingerprint sensor else it is a gem  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEPMGV2MZBBXS3AMNXHI4DIQCA4A", "customer_name": "Amazon Customer"}, "review_rating": 1.0, "review_title": "Fingerprint is fake.  ", "review_date": "26 March 2019", "review_text": "writing the review after 3months of use, on screen fingerprint not working and looks like fake, camera hang sometimes also the screen touch will not work properly, pictures are good but videos are really bad, price is also high for this phone, with my experience I will not recommend this phone to anyone  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEFA54MOTMF34FRJV5WR3YD2CHWQ", "customer_name": "Sumedh Waghmare"}, "review_rating": 5.0, "review_title": "Price is too high for what you get.  ", "review_date": "26 March 2019", "review_text": "Display quality is not as good as compared to others. Fingerprint is very slow. Auto brightness is still has lot more to mprove.  UI is really very impressive. Camera is overall good. Sound is avg. Overall phone is good. But not worthy. Price is too high for what you get.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHJPHNXZQIZI3HFVFOQETF3UKAAA", "customer_name": "Amazon Customer"}, "review_rating": 3.0, "review_title": "Not that great as I expected  ", "review_date": "25 March 2019", "review_text": "It hangs with some apps and is quite heavier than one plus 6.. Fingerprint sensor is good though  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AE7UF7RHRYLLDOH7EAMJEEXYO3HQ", "customer_name": "Hardik Pareek"}, "review_rating": 5.0, "review_title": "Overall phone is awesome  ", "review_date": "25 March 2019", "review_text": "Inbuilt fingerprint scanner is not that good  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFJUVAD2VAALEZEAHEDSFFR7C4NA", "customer_name": "Aditya a."}, "review_rating": 3.0, "review_title": "It's a ok not worthy buying it  ", "review_date": "25 March 2019", "review_text": "One plus 6t has front screen sensor it's useless some time reads the fingerprint some gives error. This is main draback of the phone and battery gets drain early as compared to other mi phones  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AH2RZFAXH4PTUQ7T7GWBUPV4MFIA", "customer_name": "ankush singh chauhan"}, "review_rating": 5.0, "review_title": "awesome mobile in great price  ", "review_date": "24 March 2019", "review_text": "I have used samsung s9 before having this mobile. After using this i am surprised with the differences. Oneplus 6T is far far far better in every field except in looks becausse of S9 curved display.Battery - 7 hrs SOT with 24 hrs idle time.Camera - Best in class. i observed S9 captured bit better in low light, because of f1.6 aperture, oneplus 6t is not far behind. Thanks to night mode.bokeh/portrait mode is exceptionnaly better than s9 and same with Day light.Display - S9 has better display but u cant use that otherwise your battery wont even last for 3 hours. Oneplus 6T has Amoled display which is enough for me.Indisplay Fingerprint - Using first time in any mobile, i liked it . response time is few micro seconds more than traditional finger print scanner. only few ms.Face Recognition - Great, even in full dark. most of the time u wont even see the lock screen as soon as u press the lock button it opens. In full dark, it uses screen light to recognize the face.Processer and performance - Best in class. i used to play pubg in high settings without any heating issue. All games runs very smooth. i tried GTA, asphalt, need for speed NL, etc.Gesture support is great after update. Its very fast and user friendly.Sound - Single speaker, Speaker sound is OK, not so great. S9 has better speaker sound than this.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AEL3KZLUFS3Z5YR6UK5NAURBODIA", "customer_name": "RaviAishwarya"}, "review_rating": 5.0, "review_title": "1+99=💯  ", "review_date": "24 March 2019", "review_text": "Superphone as Captain marvel,camera is fantastic , dash charging is super, indisplay fingerprint takes 3-4sec to unlock  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHHZOUK7BFYQL6NFIUDQHYM4OVGQ", "customer_name": "Ritvik Rehan"}, "review_rating": 5.0, "review_title": "Fingerprint Sensor  ", "review_date": "23 March 2019", "review_text": "Inbuilt finger print sensor not up to mark,needs drastic improvement.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHOOKQTO3RAGDYK4DIJYBHAPY5SQ", "customer_name": "paresh"}, "review_rating": 4.0, "review_title": "Good one  ", "review_date": "23 March 2019", "review_text": "Fingerprint sensor is slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHZCGBKB3NQNQNIPGEYQBL6M7HHQ", "customer_name": "Pradeep"}, "review_rating": 5.0, "review_title": "Best Mobile  ", "review_date": "23 March 2019", "review_text": "Face recognition is very accurate but in display fingerprint needs improvement  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AE6NA7B4ZOEJPGLRWALUFMUHFAQQ", "customer_name": "Archit"}, "review_rating": 5.0, "review_title": "Fingerprint  ", "review_date": "22 March 2019", "review_text": "Fingerprint sensor is pathetic..!  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGFVVHAJX52YMKFNJMH4EKJYE6SQ", "customer_name": "Amazon Customer"}, "review_rating": 5.0, "review_title": "Overall a very good phone, but night mode and screen Fingerprint is below average  ", "review_date": "22 March 2019", "review_text": "Screen Fingerprint is not perfect yet, it takes time to open sometimes.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGBPZBW3PJ6YYBW4O4XADSG3KZAQ", "customer_name": "Amazon Customer"}, "review_rating": 2.0, "review_title": "Hangs a lot  ", "review_date": "22 March 2019", "review_text": "I purchased this phone and within 1 month I have started facing problems. The lock/unlock is very slow, even slower is the fingerprint scanner. Whenever I take a picture in night mode, the phone hangs and I have to restart it every time. Overall also, the phone is a bit slow as compared to my previous phone (one plus 5). Performance wise also one plus 5 was way better than one plus 6T.On contacting the customer care, they will just give you some force restart and format steps which will not really help.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHDQY5SBZOABWCUCDTCM5KVPKW3Q", "customer_name": "Parvinder Singh Arora"}, "review_rating": 5.0, "review_title": "Very Good product  ", "review_date": "22 March 2019", "review_text": "Fingerprint could be a little better  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AFKGZNDIFL6TZDTPOKPH6RILJ5FQ", "customer_name": "snehal sawant"}, "review_rating": 5.0, "review_title": "Recommendable phone.  ", "review_date": "22 March 2019", "review_text": "Build quality is good. Phone is looking handsome. Two things bothering me. one is notification light. There is no notification light on top of screen so I need to awake my phone everytime to check any message or so. Second thing is fingerprint sensor. It is very sensible I must say unlike the back one. I need to put my finger in proper way otherwise I won't be able to unlock my phone.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AE2R4BXQEXEZS7K3DJPMGJHVTDTQ", "customer_name": "Vamsi Krishna"}, "review_rating": 4.0, "review_title": "Pretty Normal.  ", "review_date": "21 March 2019", "review_text": "Review on the forst week:Me using Android didn't find any added advantages over other mobiles that i have used like vivo, mi, honor, lenovo etc.,Yes, the major is speed, display and image quality.Onscreen fingerprint sensor is working much slower when hand has very little moisture even. Not satisfied with that.Whyswitch for ring/vinraye/silent is given couldn't understand.Had played a simulator game for 15 mins and phone heated up like hell. Have to check more on this issue.Packing of one plus, the elegant and stylish look are the pros pleased me. Other than that, i found OnePlus 6t as normal Android phone from other makers.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHCYAGZPWO3IGIGG5J4OWKYRQXOA", "customer_name": "satyam singh"}, "review_rating": 5.0, "review_title": "Good buy  ", "review_date": "21 March 2019", "review_text": "The on screen fingerprint is second slow  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGIVY7YKGUOKIIZBDAEN77J4RCUA", "customer_name": "Jai"}, "review_rating": 4.0, "review_title": "Best in Budget  ", "review_date": "21 March 2019", "review_text": "Super fast delivery and lovely phone. Fingerprint scanner needs improvement.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHTGG2W5AGT532FDTCSA6DRZ457A", "customer_name": "Dr. Rahul Banerjee"}, "review_rating": 4.0, "review_title": "OnePlus 6T a masterpiece Mobile Phone with Not so good Fingerprint/Face recognition capability  ", "review_date": "20 March 2019", "review_text": "OnePlus 6T is an asset to have it. But such high quality and high end product is with average fingerprint recognition/ face recognition capability. Quite often compel to open with code due to non-recognition of fingerprint. To overcome the problem three times fingerprints have been re-setup but still fingerprint recognition is moderate.In low light performance is moderate.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHHVUSOPUPMTXGD4HK5D2KYOY5YQ", "customer_name": "preethi"}, "review_rating": 4.0, "review_title": "Night potrait is awesome  ", "review_date": "20 March 2019", "review_text": "Phone is good. Photo clarity is really amazing. Fingerprint sensor and face recog are working too good.and have tried night studio camera and it works really well. Instead of tempered one plus comes only with the plastic screen guard so need to buy a tempered glass. Overall it's gud  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHGSR7D3CPSDD7I4DRDICBN63LKA", "customer_name": "ketan shah"}, "review_rating": 5.0, "review_title": "awesome handset  ", "review_date": "20 March 2019", "review_text": "like  it too muchIn love with the fingerprint scanner and it's animation !Battery lasts one day +Industry leading camera with studio mode works fantastic !Catchy display !Fast like a flash !Great Value for money !!  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AHNPXKBKAKDAFRHW37IMCSXOVSQQ", "customer_name": "Anshuman Dwivedi"}, "review_rating": 5.0, "review_title": "Good  ", "review_date": "19 March 2019", "review_text": "I am happy with its Performance, Ram management, display and battery life.I am unhappy with camera (especially night mode), face recongintion and fingerprint sensor.  "}, {"customer_profile": {"profile_url": "https://www.amazon.in/gp/profile/amzn1.account.AGOITOW62ZEENSRH2DE3SRDGK2OA", "customer_name": "mohit sehrawat"}, "review_rating": 5.0, "review_title": "Money Worthy  ", "review_date": "19 March 2019", "review_text": "Camera, in display fingerprint scanner are the major highlights.  "}]